data/WLM Data/Full Login/ab.xml

https://by6.omega.contacts.msn.com/abservice/abservice.asmx

POST /abservice/abservice.asmx HTTP/1.1
Accept: text/*
SOAPAction: http://www.msn.com/webservices/AddressBook/ABFindAll
Content-Type: text/xml; charset=utf-8
User-Agent: MSN Explorer/9.0 (MSN 8.0; TmstmpExt)
Host: by6.omega.contacts.msn.com
Content-Length: 1879
Connection: Keep-Alive
Cache-Control: no-cache

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <soap:Header>
    <ABApplicationHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ApplicationId>996CDE1E-AA53-4477-B943-2BE802EA6166</ApplicationId>
      <IsMigration>false</IsMigration>
      <PartnerScenario>Initial</PartnerScenario>
      <CacheKey>12r3:oor7v1zvsCWKJuVkuHVD/V55/HcIjzfc4Z5yujljk7X2iRmabuQZYoRj05nUyeUKxPMHJQe1OXEU7U/edeCmIcjQJ37EZJ/JyZkPbybDES3l68dsD4hWc5jGU6Xi9yd2dbPusrpDvDG0FOD3LYKUlYdQf4xs3Txlo4btPDbIUr4=</CacheKey>
    </ABApplicationHeader>
    <ABAuthHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ManagedGroupRequest>false</ManagedGroupRequest>
      <TicketToken>t=EwDIAcBdAAAU7/9PdvvYJ23zPPtor/FYp6zOOb+AACew9ABFVGaeqeAlfNvbF6YT/OdKwLUyxGarq/yhjJPpF4tA276y46WLReFrChN6/CEU31akhJ1tAuM2Fni9XEaMGVVA7jlW1dmDVMa3bMikxS+nsUoY4vYCsSgnbMxDIMeuLmDsm/zV5frFKVU+ysItr+5XDBAv6vJDx0eysW9CA2YAAAhiV61UfqJ2SBgBQ+RoEReNgU+pvGoPtjraJlXQMfhsELqueLs598z1V2PEZUUB88Vtkbb6dIRgM4c16IlrNm8RQkd8iz5i8EmCrn/7FCEscbp84v2X+6a4sqd29f7PWd54ZztxHhAJPIuJ6ZtciEp0U3lu20jW9JCq4LH6ydxGD1Hyo0FHk8kLWEjvDylQCmcLIIHDFHOQOsYa7LtsSytMen5pG3EpQCxDjmyBtjyFz7PIHm3ZOApetTjCLAVSb5LrNjadGlyWzJdwPQP7uR6tg2GoqrYzbgMkMwp0gudoCSAagAyM6QhmGy3Agwfd2yKJW/K7O/CRbqF0GaVunIS4laI1aT/M82NP2atntRL8m6+3kqupjMyTvb2oOG12sf7tSTAB&amp;p=</TicketToken>
    </ABAuthHeader>
  </soap:Header>
  <soap:Body>
    <ABFindAll xmlns="http://www.msn.com/webservices/AddressBook">
      <abId>00000000-0000-0000-0000-000000000000</abId>
      <abView>Full</abView>
      <deltasOnly>true</deltasOnly>
      <lastChange>2007-06-06T10:15:28.373-07:00</lastChange>
      <dynamicItemView>Gleam</dynamicItemView>
      <dynamicItemLastChange>2007-06-06T10:14:29.357-07:00</dynamicItemLastChange>
    </ABFindAll>
  </soap:Body>
</soap:Envelope>
=======================================
HTTP/1.1 200 OK
Date: Thu, 07 Jun 2007 17:45:03 GMT
Server: Microsoft-IIS/6.0
P3P:CP="BUS CUR CONo FIN IVDo ONL OUR PHY SAMo TELo"
X-Powered-By: ASP.NET
X-MSNSERVER: BY2ABCHWB128
X-AspNet-Version: 2.0.50727
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Length: 4401

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <ServiceHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <Version>
        12.03.1527.0001
      </Version>
      <CacheKeyChanged>false</CacheKeyChanged>
      <PreferredHostName>by6.omega.contacts.msn.com</PreferredHostName>
    </ServiceHeader>
  </soap:Header>
  <soap:Body>
    <ABFindAllResponse xmlns="http://www.msn.com/webservices/AddressBook">
      <ABFindAllResult>
        <contacts>
          <Contact>
            <contactId>4b6f3558-14c0-4491-a78d-14bffda186ae</contactId>
            <contactInfo>
              <emails>
                <ContactEmail>
                  <contactEmailType>ContactEmailPersonal</contactEmailType>
                  <email>pyzhang8@hotmail.com</email>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <Capability>0</Capability>
                  <MessengerEnabledExternally>false</MessengerEnabledExternally>
                  <propertiesChanged />
                </ContactEmail>
              </emails>
              <phones>
                <ContactPhone>
                  <contactPhoneType>ContactPhonePersonal</contactPhoneType>
                  <number>home phone</number>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <propertiesChanged />
                </ContactPhone>
              </phones>
              <locations>
                <ContactLocation>
                  <contactLocationType>ContactLocationPersonal</contactLocationType>
                  <street>Hu Bei</street>
                  <city>
                    鍖椾含甯?/city><state>鍖椾含</state><country>涓浗</country><postalCode>100080</postalCode><Changes />
                </ContactLocation>
                <ContactLocation>
                  <contactLocationType>ContactLocationBusiness</contactLocationType>
                  <name>ICT.CAS</name>
                  <city>Bei Jing</city>
                  <state>Bei Jing</state>
                  <country>China</country>
                  <postalCode>100080</postalCode>
                  <Department>NCIC</Department>
                  <Changes />
                </ContactLocation>
              </locations>
              <annotations>
                <Annotation>
                  <Name>AB.JobTitle</Name>
                  <Value>Student</Value>
                </Annotation>
                <Annotation>
                  <Name>AB.Profession</Name>
                  <Value>CS</Value>
                </Annotation>
                <Annotation>
                  <Name>AB.NickName</Name>
                  <Value>zpy</Value>
                </Annotation>
              </annotations>
              <contactType>Live</contactType>
              <quickName>pyzhang8</quickName>
              <firstName>
                鏀€鍕?/firstName><lastName>
                  寮?/lastName><passportName>pyzhang8@hotmail.com</passportName><IsPassportNameHidden>false</IsPassportNameHidden><displayName>panyong| ^_^</displayName><puid>0</puid><CID>-7779442052170503227</CID><IsNotMobileVisible>false</IsNotMobileVisible><isMobileIMEnabled>false</isMobileIMEnabled><isMessengerUser>true</isMessengerUser><isFavorite>false</isFavorite><isSmtp>false</isSmtp><hasSpace>true</hasSpace><spotWatchState>NoDevice</spotWatchState><birthdate>1981-04-06T00:00:00-07:00</birthdate><primaryEmailType>ContactEmailPersonal</primaryEmailType><PrimaryLocation>ContactLocationPersonal</PrimaryLocation><PrimaryPhone>ContactPhonePersonal</PrimaryPhone><IsPrivate>false</IsPrivate><Gender>Unspecified</Gender><TimeZone>None</TimeZone>
            </contactInfo>
            <propertiesChanged />
            <fDeleted>false</fDeleted>
            <lastChange>2007-06-07T10:24:46.72-07:00</lastChange>
          </Contact>
        </contacts>
        <CircleResult>
          <CircleTicket>
            &lt;?xml version="1.0" encoding="utf-16"?&gt;
            &lt;SignedTicket xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" ver="1" keyVer="1"&gt;
            &lt;Data&gt;PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTE2Ij8+DQo8VGlja2V0IHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2UiIHhtbG5zOnhzZD0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiPg0KICA8VFM+MjAwNy0wNi0wN1QxNzo0NTowMy40NzY1Mzc4WjwvVFM+DQogIDxDSUQ+ODY2MDY2NjcwMTkxOTMxNDI0PC9DSUQ+DQo8L1RpY2tldD4=&lt;/Data&gt;
            &lt;Sig&gt;sFZfGK8yZg/TQUDYvVtNLx3uSpq3edcutOkTTtEr+kF98IYjdIc4DZN2A2pWSG0FApUleL3TTi3JE+XU8Q5niOd62gp+4LGDB10CkGpsp1ogCN1TZrTGfK3DfUHF4fGS3R7tUHL59hahqvbSu/DFv1aGj1kK9v1JGN0MH8yZ0JI=&lt;/Sig&gt;
            &lt;/SignedTicket&gt;
          </CircleTicket>
        </CircleResult>
        <ab>
          <abId>00000000-0000-0000-0000-000000000000</abId>
          <abInfo>
            <ownerPuid>0</ownerPuid>
            <OwnerCID>866066670191931424</OwnerCID>
            <ownerEmail>kopetesoc@hotmail.com</ownerEmail>
            <fDefault>true</fDefault>
            <joinedNamespace>false</joinedNamespace>
            <IsBot>false</IsBot>
            <IsParentManaged>false</IsParentManaged>
            <SubscribeExternalPartner>false</SubscribeExternalPartner>
            <NotifyExternalPartner>false</NotifyExternalPartner>
            <AddressBookType>Individual</AddressBookType>
          </abInfo>
          <lastChange>2007-06-07T10:24:46.72-07:00</lastChange>
          <DynamicItemLastChanged>2007-06-06T10:14:29.357-07:00</DynamicItemLastChanged>
          <createDate>2007-03-10T00:09:11.543-08:00</createDate>
          <propertiesChanged />
        </ab>
      </ABFindAllResult>
    </ABFindAllResponse>
  </soap:Body>
</soap:Envelope>