data/WLM Data/Full Login/getUpdatedContactInfo.xml

https://by6.omega.contacts.msn.com/abservice/abservice.asmx
POST /abservice/abservice.asmx HTTP/1.1
Accept: text/*
SOAPAction: http://www.msn.com/webservices/AddressBook/ABFindAll
Content-Type: text/xml; charset=utf-8
User-Agent: MSN Explorer/9.0 (MSN 8.0; TmstmpExt)
Host: by6.omega.contacts.msn.com
Content-Length: 1881
Connection: Keep-Alive
Cache-Control: no-cache

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <soap:Header>
    <ABApplicationHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ApplicationId>996CDE1E-AA53-4477-B943-2BE802EA6166</ApplicationId>
      <IsMigration>false</IsMigration>
      <PartnerScenario>ContactSave</PartnerScenario>
      <CacheKey>12r3:oor7v1zvsCWKJuVkuHVD/V55/HcIjzfc4Z5yujljk7X2iRmabuQZYoRj05nUyeUKxPMHJQe1OXEU7U/edeCmIcjQJ37EZJ/JyZkPbybDES3l68dsD4hWc5jGU6Xi9yd2dbPusrpDvDG0FOD3LYKUlYdQf4xs3Txlo4btPDbIUr4=</CacheKey>
    </ABApplicationHeader>
    <ABAuthHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ManagedGroupRequest>false</ManagedGroupRequest>
      <TicketToken>t=EwDIAcBdAAAU7/9PdvvYJ23zPPtor/FYp6zOOb+AACew9ABFVGaeqeAlfNvbF6YT/OdKwLUyxGarq/yhjJPpF4tA276y46WLReFrChN6/CEU31akhJ1tAuM2Fni9XEaMGVVA7jlW1dmDVMa3bMikxS+nsUoY4vYCsSgnbMxDIMeuLmDsm/zV5frFKVU+ysItr+5XDBAv6vJDx0eysW9CA2YAAAhiV61UfqJ2SBgBQ+RoEReNgU+pvGoPtjraJlXQMfhsELqueLs598z1V2PEZUUB88Vtkbb6dIRgM4c16IlrNm8RQkd8iz5i8EmCrn/7FCEscbp84v2X+6a4sqd29f7PWd54ZztxHhAJPIuJ6ZtciEp0U3lu20jW9JCq4LH6ydxGD1Hyo0FHk8kLWEjvDylQCmcLIIHDFHOQOsYa7LtsSytMen5pG3EpQCxDjmyBtjyFz7PIHm3ZOApetTjCLAVSb5LrNjadGlyWzJdwPQP7uR6tg2GoqrYzbgMkMwp0gudoCSAagAyM6QhmGy3Agwfd2yKJW/K7O/CRbqF0GaVunIS4laI1aT/M82NP2atntRL8m6+3kqupjMyTvb2oOG12sf7tSTAB&amp;p=</TicketToken>
    </ABAuthHeader>
  </soap:Header>
  <soap:Body>
    <ABFindAll xmlns="http://www.msn.com/webservices/AddressBook">
      <abId>00000000-0000-0000-0000-000000000000</abId>
      <abView>Full</abView>
      <deltasOnly>true</deltasOnly>
      <lastChange>2007-06-07T10:51:57.2-07:00</lastChange>
      <dynamicItemView>Gleam</dynamicItemView>
      <dynamicItemLastChange>2007-06-06T10:14:29.357-07:00</dynamicItemLastChange>
    </ABFindAll>
  </soap:Body>
</soap:Envelope>

=================
HTTP/1.1 200 OK
Date: Thu, 07 Jun 2007 17:59:15 GMT
Server: Microsoft-IIS/6.0
P3P:CP="BUS CUR CONo FIN IVDo ONL OUR PHY SAMo TELo"
X-Powered-By: ASP.NET
X-MSNSERVER: BY2ABCHWB1
X-AspNet-Version: 2.0.50727
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Length: 6605

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <ServiceHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <Version>
        12.03.1527.0001
      </Version>
      <CacheKeyChanged>false</CacheKeyChanged>
      <PreferredHostName>by6.omega.contacts.msn.com</PreferredHostName>
    </ServiceHeader>
  </soap:Header>
  <soap:Body>
    <ABFindAllResponse xmlns="http://www.msn.com/webservices/AddressBook">
      <ABFindAllResult>
        <contacts>
          <Contact>
            <contactId>3b0977f1-b62e-4dd3-80e4-8a216118c70a</contactId>
            <contactInfo>
              <emails>
                <ContactEmail>
                  <contactEmailType>ContactEmailPersonal</contactEmailType>
                  <email>contact_p_email@abc.com</email>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <Capability>0</Capability>
                  <MessengerEnabledExternally>false</MessengerEnabledExternally>
                  <propertiesChanged />
                </ContactEmail>
                <ContactEmail>
                  <contactEmailType>ContactEmailBusiness</contactEmailType>
                  <email>work_email@abc.com</email>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <Capability>0</Capability>
                  <MessengerEnabledExternally>false</MessengerEnabledExternally>
                  <propertiesChanged />
                </ContactEmail>
                <ContactEmail>
                  <contactEmailType>ContactEmailOther</contactEmailType>
                  <email>other_email@abc.com</email>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <Capability>0</Capability>
                  <MessengerEnabledExternally>false</MessengerEnabledExternally>
                  <propertiesChanged />
                </ContactEmail>
                <ContactEmail>
                  <contactEmailType>ContactEmailMessenger</contactEmailType>
                  <email>other_IM_addrss@abc.com</email>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <Capability>0</Capability>
                  <MessengerEnabledExternally>false</MessengerEnabledExternally>
                  <propertiesChanged />
                </ContactEmail>
              </emails>
              <phones>
                <ContactPhone>
                  <contactPhoneType>ContactPhonePersonal</contactPhoneType>
                  <number>personal_home_phone</number>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <propertiesChanged />
                </ContactPhone>
                <ContactPhone>
                  <contactPhoneType>ContactPhoneBusiness</contactPhoneType>
                  <number>work_phone</number>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <propertiesChanged />
                </ContactPhone>
                <ContactPhone>
                  <contactPhoneType>ContactPhoneMobile</contactPhoneType>
                  <number>+86123456</number>
                  <isMessengerEnabled>true</isMessengerEnabled>
                  <propertiesChanged />
                </ContactPhone>
                <ContactPhone>
                  <contactPhoneType>ContactPhonePager</contactPhoneType>
                  <number>work_mobile</number>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <propertiesChanged />
                </ContactPhone>
                <ContactPhone>
                  <contactPhoneType>ContactPhoneFax</contactPhoneType>
                  <number>work_home_fax</number>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <propertiesChanged />
                </ContactPhone>
                <ContactPhone>
                  <contactPhoneType>ContactPhoneOther</contactPhoneType>
                  <number>other_phone-contact</number>
                  <isMessengerEnabled>false</isMessengerEnabled>
                  <propertiesChanged />
                </ContactPhone>
              </phones>
              <locations>
                <ContactLocation>
                  <contactLocationType>ContactLocationPersonal</contactLocationType>
                  <street>personal_street_add</street>
                  <city>personal_city</city>
                  <state>state</state>
                  <country>country</country>
                  <postalCode>personal-zip</postalCode>
                  <Changes />
                </ContactLocation>
                <ContactLocation>
                  <contactLocationType>ContactLocationBusiness</contactLocationType>
                  <name>company</name>
                  <street>work_addr</street>
                  <city>work_city</city>
                  <state>work_state</state>
                  <country>work_country</country>
                  <postalCode>work_zip</postalCode>
                  <Changes />
                </ContactLocation>
              </locations>
              <webSites>
                <ContactWebSite>
                  <contactWebSiteType>ContactWebSitePersonal</contactWebSiteType>
                  <webURL>http://personal.website.com</webURL>
                </ContactWebSite>
                <ContactWebSite>
                  <contactWebSiteType>ContactWebSiteBusiness</contactWebSiteType>
                  <webURL>http://work_website.com</webURL>
                </ContactWebSite>
              </webSites>
              <annotations>
                <Annotation>
                  <Name>AB.JobTitle</Name>
                  <Value>title</Value>
                </Annotation>
                <Annotation>
                  <Name>AB.Spouse</Name>
                  <Value>spouse</Value>
                </Annotation>
                <Annotation>
                  <Name>AB.NickName</Name>
                  <Value>spleak.nickname</Value>
                </Annotation>
              </annotations>
              <contactType>LiveRejected</contactType>
              <quickName>spleak</quickName>
              <firstName>firstname</firstName>
              <lastName>lastname</lastName>
              <passportName>spleak@hotmail.com</passportName>
              <IsPassportNameHidden>false</IsPassportNameHidden>
              <displayName>- Spleak - Guess the (*)Celeb(*) to save the Stickman :P type "hangman"</displayName>
              <puid>0</puid>
              <CID>8017098637279171394</CID>
              <comment>Notes 111</comment>
              <IsNotMobileVisible>false</IsNotMobileVisible>
              <isMobileIMEnabled>false</isMobileIMEnabled>
              <isMessengerUser>true</isMessengerUser>
              <isFavorite>false</isFavorite>
              <isSmtp>false</isSmtp>
              <hasSpace>false</hasSpace>
              <spotWatchState>NoDevice</spotWatchState>
              <birthdate>1983-01-23T16:00:00-08:00</birthdate>
              <primaryEmailType>ContactEmailPersonal</primaryEmailType>
              <PrimaryLocation>ContactLocationPersonal</PrimaryLocation>
              <PrimaryPhone>ContactPhonePersonal</PrimaryPhone>
              <IsPrivate>false</IsPrivate>
              <Anniversary>2000/02/02</Anniversary>
              <Gender>Unspecified</Gender>
              <TimeZone>None</TimeZone>
            </contactInfo>
            <propertiesChanged />
            <fDeleted>false</fDeleted>
            <lastChange>2007-06-07T10:59:14.157-07:00</lastChange>
          </Contact>
        </contacts>
        <CircleResult>
          <CircleTicket>
            &lt;?xml version="1.0" encoding="utf-16"?&gt;
            &lt;SignedTicket xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" ver="1" keyVer="1"&gt;
            &lt;Data&gt;PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTE2Ij8+DQo8VGlja2V0IHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2UiIHhtbG5zOnhzZD0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiPg0KICA8VFM+MjAwNy0wNi0wN1QxNzo1OToxNS4yOTkxMDY4WjwvVFM+DQogIDxDSUQ+ODY2MDY2NjcwMTkxOTMxNDI0PC9DSUQ+DQo8L1RpY2tldD4=&lt;/Data&gt;
            &lt;Sig&gt;f2ZgBZrqcYmvTppvM/TC6Q52XdzEBj8TxQnBHFFc7ldmIlasXEuwOOM+KaZdI3b1DuKd0TPIUOtJX/KD+DJwgNumrcmbtx9FoATJ/aIrpaegG25djqUhezRHOPVar04wYV9SnwsIBU+/mePDP6YVflW5auEsNQktIaspzKwdCcU=&lt;/Sig&gt;
            &lt;/SignedTicket&gt;
          </CircleTicket>
        </CircleResult>
        <ab>
          <abId>00000000-0000-0000-0000-000000000000</abId>
          <abInfo>
            <ownerPuid>0</ownerPuid>
            <OwnerCID>866066670191931424</OwnerCID>
            <ownerEmail>kopetesoc@hotmail.com</ownerEmail>
            <fDefault>true</fDefault>
            <joinedNamespace>false</joinedNamespace>
            <IsBot>false</IsBot>
            <IsParentManaged>false</IsParentManaged>
            <SubscribeExternalPartner>false</SubscribeExternalPartner>
            <NotifyExternalPartner>false</NotifyExternalPartner>
            <AddressBookType>Individual</AddressBookType>
          </abInfo>
          <lastChange>2007-06-07T10:59:14.157-07:00</lastChange>
          <DynamicItemLastChanged>2007-06-06T10:14:29.357-07:00</DynamicItemLastChanged>
          <createDate>2007-03-10T00:09:11.543-08:00</createDate>
          <propertiesChanged />
        </ab>
      </ABFindAllResult>
    </ABFindAllResponse>
  </soap:Body>
</soap:Envelope>